In [1]:
import pandas as pd

In [2]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['London', 'New York', 'Paris', 'Paris', 'Sydney'],
    'Salary': [60000, 75000, 80000, 70000, 65000]
}

In [3]:
employees = pd.DataFrame(data)

In [4]:
employees

      Name  Age      City  Salary
0    Alice   25    London   60000
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000
3    David   28     Paris   70000
4     Emma   32    Sydney   65000

In [22]:
last_two = employees.index[-2:]
employees.loc[last_two, ["Name", "Salary"]]

    Name  Salary
3  David   70000
4   Emma   65000

In [25]:
employees.iloc[-2:, [0, 3]]

    Name  Salary
3  David   70000
4   Emma   65000

In [32]:
employees.loc[0:, [True, True, True, True]][employees["Age"] >= 30]

      Name  Age      City  Salary
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000
4     Emma   32    Sydney   65000

In [33]:
employees[employees["Age"] >= 30]

      Name  Age      City  Salary
1      Bob   30  New York   75000
2  Charlie   35     Paris   80000
4     Emma   32    Sydney   65000